       01 FAKE-GETADDR-CONTROL EXTERNAL.
           05 FG-CALL-COUNT         PIC S9(9) COMP-5.
           05 FG-FREE-COUNT         PIC S9(9) COMP-5.
           05 FG-VALID              PIC X.
           05 FG-NODE-LENGTH        PIC S9(9) COMP-5.
           05 FG-SERVICE-LENGTH     PIC S9(9) COMP-5.
           05 FG-NODE               PIC X(254).
           05 FG-SERVICE            PIC X(6).
