       01 FAKE-HTTP-CONTROL EXTERNAL.
           05 FH-SCHEMA-ENABLED    PIC X.
           05 FH-FULL-RESPONSE     PIC X.
           05 FH-ADD-FINAL         PIC X.
           05 FH-EXPECT-CONTINUE   PIC X.
           05 FH-SCHEMA-LENGTH     PIC S9(9) COMP-5.
           05 FH-SCHEMA-ITEM       PIC X(1024).
           05 FH-CALL-ID-LENGTH    PIC S9(9) COMP-5.
           05 FH-CALL-ID           PIC X(1024).
           05 FH-BOUNDARY-MODE     PIC S9(9) COMP-5.
           05 FH-BOUNDARY-STEP     PIC S9(9) COMP-5.
           05 FH-BOUNDARY-ACTUAL   PIC S9(9) COMP-5.
