       01 FAKE-OUTPUT-CONTROL EXTERNAL.
           05 FO-FAIL-CALL          PIC S9(9) COMP-5.
           05 FO-CALL-COUNT         PIC S9(9) COMP-5.
           05 FO-STDOUT-LENGTH      PIC S9(9) COMP-5.
           05 FO-STDERR-LENGTH      PIC S9(9) COMP-5.
           05 FO-STDOUT             PIC X(8192).
           05 FO-STDERR             PIC X(8192).
