       01 FAKE-TLS-CLOSE-CONTROL EXTERNAL.
           05 FT-VALID              PIC X.
           05 FT-PENDING            PIC X.
           05 FT-SHUTDOWN-COUNT     PIC S9(9) COMP-5.
           05 FT-GET-ERROR-COUNT    PIC S9(9) COMP-5.
