       01 ZLAUNCH-FAKE-CONTROL EXTERNAL.
           05 ZF-CALL-COUNT PIC S9(9) COMP-5.
           05 ZF-STATUS PIC S9(9) COMP-5.
           05 ZF-PLATFORM PIC S9(9) COMP-5.
           05 ZF-ARG-COUNT PIC S9(9) COMP-5.
           05 ZF-TASK-LENGTH PIC S9(9) COMP-5.
           05 ZF-TASK PIC X(65535).
