       IDENTIFICATION DIVISION.
       PROGRAM-ID. GREETER.

       DATA DIVISION.
       LINKAGE SECTION.
       COPY HELLOMSG.

       PROCEDURE DIVISION USING HELLO-RESPONSE.
           MOVE "Hello, world!" TO HELLO-MESSAGE
           EXIT PROGRAM.

       END PROGRAM GREETER.
