       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY HELLOMSG.

       PROCEDURE DIVISION.
           CALL "GREETER" USING HELLO-RESPONSE
           DISPLAY HELLO-MESSAGE
           STOP RUN.

       END PROGRAM HELLO.
