      * z/OS 31-bit EZASOKET call-interface declarations.
       01 ZN-FUNCTIONS.
           05 ZN-INITAPI PIC X(16) VALUE "INITAPI".
           05 ZN-TERMAPI PIC X(16) VALUE "TERMAPI".
           05 ZN-GETADDRINFO PIC X(16) VALUE "GETADDRINFO".
           05 ZN-FREEADDRINFO PIC X(16) VALUE "FREEADDRINFO".
           05 ZN-SOCKET PIC X(16) VALUE "SOCKET".
           05 ZN-CONNECT PIC X(16) VALUE "CONNECT".
           05 ZN-READ PIC X(16) VALUE "READ".
           05 ZN-WRITE PIC X(16) VALUE "WRITE".
           05 ZN-CLOSE PIC X(16) VALUE "CLOSE".
           05 ZN-IOCTL PIC X(16) VALUE "IOCTL".
       01 ZN-MAXSOC PIC 9(4) BINARY VALUE 50.
       01 ZN-IDENT.
           05 ZN-TCPNAME PIC X(8) VALUE SPACES.
           05 ZN-ADSNAME PIC X(8) VALUE SPACES.
       01 ZN-SUBTASK PIC X(8) VALUE "COBOLLM".
       01 ZN-MAXSNO PIC 9(8) BINARY.
       01 ZN-ERRNO PIC 9(8) BINARY.
       01 ZN-RETCODE PIC S9(8) BINARY.
       01 ZN-AF PIC 9(8) BINARY.
       01 ZN-SOCKTYPE PIC 9(8) BINARY VALUE 1.
       01 ZN-PROTOCOL PIC 9(8) BINARY VALUE 6.
       01 ZN-SOCKET-DESCRIPTOR PIC S9(4) BINARY VALUE -1.
       01 ZN-EINTR PIC 9(8) BINARY VALUE 120.
       01 ZN-NBYTE PIC 9(8) BINARY.
       01 ZN-NODE PIC X(253).
       01 ZN-NODELEN PIC 9(8) BINARY.
       01 ZN-SERVICE PIC X(5).
       01 ZN-SERVLEN PIC 9(8) BINARY.
       01 ZN-CANONLEN PIC 9(8) BINARY.
       01 ZN-HINTS.
           05 ZN-HINTS-FLAGS PIC 9(8) BINARY.
           05 ZN-HINTS-FAMILY PIC 9(8) BINARY.
           05 ZN-HINTS-SOCKTYPE PIC 9(8) BINARY.
           05 ZN-HINTS-PROTOCOL PIC 9(8) BINARY.
           05 FILLER PIC 9(8) BINARY.
           05 FILLER PIC 9(8) BINARY.
           05 FILLER PIC 9(8) BINARY.
           05 FILLER PIC 9(8) BINARY.
       01 ZN-HINTS-PTR USAGE POINTER.
       01 ZN-RESULTS-PTR USAGE POINTER.
       01 ZN-CURRENT-RESULT USAGE POINTER.
       01 ZN-NAME-LEN PIC 9(8) BINARY.
       01 ZN-CANONICAL-NAME PIC X(256).
       01 ZN-NAME-PTR USAGE POINTER.
       01 ZN-NEXT-PTR USAGE POINTER.
       01 ZN-SOCKET-ADDRESS BASED.
           05 ZN-SA-FAMILY PIC 9(4) BINARY.
           05 ZN-SA-PORT PIC 9(4) BINARY.
           05 ZN-SA-DATA PIC X(24).
      * The target compile verifies this 31-bit LE sigaction layout.
       01 ZN-SIGPIPE PIC S9(8) BINARY VALUE 13.
       01 ZN-SIG-IGN USAGE POINTER VALUE 1.
       01 ZN-NEW-ACTION.
           05 ZN-NEW-HANDLER USAGE POINTER.
           05 ZN-NEW-MASK PIC X(8).
           05 ZN-NEW-FLAGS PIC S9(8) BINARY.
       01 ZN-SAVED-ACTION.
           05 ZN-SAVED-HANDLER USAGE POINTER.
           05 ZN-SAVED-MASK PIC X(8).
           05 ZN-SAVED-FLAGS PIC S9(8) BINARY.
